#include <stdio.h>

int main() {

float a =0.617;//ประกาศตัวแปร a เป็น float และกำหนดค่าเริ่มต้นเป็น 0.617
int b =25;//ประกาศตัวแปร b เป็น int และกำหนดค่าเริ่มต้นเป็น 25
float c = 19.00;//ประกาศตัวแปร c เป็น float และกำหนดค่าเริ่มต้นเป็น 19.00
int d = 9;//ประกาศตัวแปร d เป็น int และกำหนดค่าเริ่มต้นเป็น 9
float e = 124.555;//ประกาศตัวแปร e เป็น float และกำหนดค่าเริ่มต้นเป็น 124.555
float f = 0.001;//ประกาศตัวแปร f เป็น float และกำหนดค่าเริ่มต้นเป็น 0.001

    printf("a= %5.3f%% \n",a);//ชิดขวา กว้าง 5 ทศนิยม 3 ตำแหน่ง

    printf("b= %3d%% \n", b);//ชิดขวา กว้าง 3 จำนวนเต็ม

    printf("c =%6.3f%% \n", c);//กว้าง 6 ทศนิยม 3 ตำแหน่ง

    printf("d  =%1d %% \n", d);//ชิดซ้าย กว้าง 1 จำนวนเต็ม

    printf("e=%7.3f%% \n", e);//กว้าง 7 ทศนิยม 3 ตำแหน่ง

    printf("f=%5.3f%% \n",f);//ชิดซ้าย กว้าง 5 ทศนิยม 3 ตำแหน่ง

    return 0;   
}